const raceRecord = [
  {
    lng: 120.87317734214407,
    lat: 30.388801414513747,
    name: '2023南北湖越野赛',
    date: '2023-4-9',
    type: 'trail'
  },
  {
    lng: 119.20210155115822,
    lat: 29.04682334817903,
    name: '2023龙游马拉松',
    date: '2023-4-31',
    type: 'half'
  },
  {
    lng: 120.26223336078803,
    lat: 31.56998922404184,
    name: '2023无锡惠山越野赛',
    date: '2023-5-14',
    type: 'trail'
  },
  {
    lng: 120.98224293505318,
    lat: 30.81585615868791,
    name: '中国10公里精英赛',
    date: '2023-5-20',
    type: '10km'
  },
  {
    lng: 120.34042235355406,
    lat: 31.36652255412531,
    name: '苏州太湖精英赛',
    date: '2023-6-24',
    type: 'half'
  },
  {
    lng: 120.55926295155892,
    lat: 31.298663519194648,
    name: '2023苏州太湖马拉松',
    date: '2023-10-22',
    type: 'half'
  },
  {
    lng: 119.69554496905323,
    lat: 29.79677568104662,
    name: '2023桐庐半马',
    date: '2023-10-29',
    type: 'half'
  },
  {
    lng: 120.41147329440689,
    lat: 30.630484095014577,
    name: '2023河山马拉松',
    date: '2023-11-12',
    type: 'other'
  },
  {
    lng: 120.60191026276341,
    lat: 31.187081290516794,
    name: '2023苏州1号公路马',
    date: '2023-11-19',
    type: 'half'
  },
  {
    lng: 120.56250768435906,
    lat: 30.673253970808577,
    name: '2023桐乡半马',
    date: '2023-12-3',
    type: 'half'
  },
  {
    lng: 120.25075339465701,
    lat: 29.712958656031184,
    name: '2023诸暨马拉松',
    date: '2023-12-10',
    type: 'half'
  },
  {
    lng: 119.93113642396513,
    lat: 30.593452481201297,
    name: '2023莫干山马拉松',
    date: '2023-12-24',
    type: 'half'
  },
  {
    lng: 120.69706521330673,
    lat: 30.777804463037445,
    name: '嘉兴10公里达标赛',
    date: '2023-12-31',
    type: 'other'
  },
  {
    lng: 120.35390293086589,
    lat: 29.953051645183443,
    name: '店口越野赛',
    date: '2024-3-3',
    type: 'trail'
  },
  {
    lng: 120.27486090675518,
    lat: 30.419310051806956,
    name: '临平之巅山径赛',
    date: '2024-3-10',
    type: 'trail'
  },
  {
    lng: 120.01436393612018,
    lat: 30.301108001036756,
    name: '2024梦想小镇半马',
    date: '2024-3-31',
    type: 'half'
  },
  {
    lng: 120.61713580010816,
    lat: 31.142508378479196,
    name: '2024东太湖半马',
    date: '2024-4-7',
    type: 'half'
  },
  {
    lng: 120.2110825269872,
    lat: 30.21902315253451,
    name: '滨江天街开春跑',
    date: '2024-4-13',
    type: 'other'
  },
  {
    lng: 120.70698140536106,
    lat: 31.302888694863526,
    name: '2024苏州马拉松',
    date: '2024-4-14',
    type: 'half'
  },
  {
    lng: 120.34088805817953,
    lat: 31.366958199424584,
    name: '2024太湖数字半马',
    date: '2024-5-5',
    type: 'half'
  },
  {
    lng: 120.49923780008845,
    lat: 29.741290626298877,
    name: '赵家镇越野赛',
    date: '2024-5-12',
    type: 'trail'
  },
  {
    lng: 121.0079270915161,
    lat: 30.078606117418527,
    name: '2024牟山湖半马',
    date: '2024-5-26',
    type: 'half'
  },
  {
    lng: 119.82935531208153,
    lat: 31.121099150499656,
    name: '长兴水口越野赛',
    date: '2024-6-1',
    type: 'trail'
  },
  {
    lng: 120.1216003991972,
    lat: 30.20044547902649,
    name: '踏云九溪山径赛',
    date: '2024-7-7',
    type: 'trail'
  },
  {
    lng: 120.05079419754878,
    lat: 30.94963835705361,
    name: '碧岩寺夜赛',
    date: '2024-7-27',
    type: 'trail'
  },
  {
    lng: 120.3793118283187,
    lat: 31.294310660520814,
    name: '凯乐石FUGA训练赛光福落日跑',
    date: '2024-8-31',
    type: 'trail'
  },
  {
    lng: 120.04614412931188,
    lat: 30.185371234189315,
    name: '拓野钱塘之泗乡奔月赛',
    date: '2024-9-17',
    type: 'trail'
  },
  {
    lng: 120.35390293086589,
    lat: 29.953051645183443,
    name: 'salomon月赛诸暨店口站',
    date: '2024-9-21',
    type: 'trail'
  },
  {
    lng: 120.21010864089803,
    lat: 30.364727880630102,
    name: 'salomon月赛杭州半山',
    date: '2024-9-22',
    type: 'trail'
  },
  {
    lng: 119.92400506797087,
    lat: 32.42735269384714,
    name: '2024泰州马拉松',
    date: '2024-10-20',
    type: 'half'
  },
  {
    lng: 120.77274899733175,
    lat: 30.408111106105668,
    name: '2024海宁神仙湖半马',
    date: '2024-10-26',
    type: 'half'
  },
  {
    lng: 120.58334416850096,
    lat: 30.05641187447746,
    name: '2024绍兴马拉松',
    date: '2024-11-10',
    type: 'half'
  },
  {
    lng: 121.16516423695286,
    lat: 30.79318382020883,
    name: '2024沪浙半马',
    date: '2024-11-17',
    type: 'half'
  },
  {
    lng: 120.76702898573055,
    lat: 30.741893738048198,
    name: '2024嘉兴马拉松',
    date: '2024-11-24',
    type: 'marathon'
  },
  {
    lng: 121.11671279265883,
    lat: 30.618369940602363,
    name: '2024乍浦半马',
    date: '2024-12-1',
    type: 'half'
  },
  {
    lng: 120.56260257016469,
    lat: 30.673282628828318,
    name: '2024桐乡半马',
    date: '2024-12-8',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '湖州西塞山越野赛',
    date: '2025-2-16',
    type: 'trail'
  },
  {
    lng: '',
    lat: '',
    name: '2025苏州马拉松',
    date: '2025-3-2',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '2025崇福乡村健康跑',
    date: '2025-3-22',
    type: 'other'
  },
  {
    lng: '',
    lat: '',
    name: '2025临平半程马拉松',
    date: '2025-3-23',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '2025杭州梦想小镇半程马拉松',
    date: '2025-3-30',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '2025海宁追潮半程马拉松',
    date: '2025-4-6',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '2025上海佘山半程马拉松',
    date: '2025-4-13',
    type: 'half'
  },
  {
    lng: '',
    lat: '2025石门乡村健康跑',
    name: '2025',
    date: '2025-4-19',
    type: 'other'
  },
  {
    lng: '',
    lat: '',
    name: '2025富阳半程马拉松',
    date: '2025-4-20',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: '2025中国田径协会10公里精英赛',
    date: '2025-5-11',
    type: '10km'
  },
  {
    lng: '',
    lat: '',
    name: '2025西湖半程马拉松',
    date: '2025-5-25',
    type: 'half'
  },
  {
    lng: '',
    lat: '',
    name: 'Astra 5公里',
    date: '2025-6-14',
    type: 'other'
  },
];

export { raceRecord };